performance/reports/archive/runs/normal-day-2026-08-19T06-13-45/summary.txt
     ✓ login 200
     ✓ board list 200
     ✓ refresh 200
     ✓ hot daily 200
     ✓ post create 2xx
     ✓ user info 200
     ✓ post update 200
     ✓ post list 200
     ✓ post delete 200
     ✓ friend list 200
     ✓ logout 200
     ✓ chat rooms 200
     ✓ post detail 200
     ✓ my posts 200
     ✓ unread count 200
     ✓ post reaction 2xx
     ✓ chat messages 200
     ✓ notif list 200
     ✓ comment create 2xx
     ✓ comment list 200
     ✓ post search 200
     ✓ chat read 200
     ✓ received reqs 200
     ✓ scrap 2xx
     ✓ comment reaction 200
     ✓ meal today 200
     ✓ timetable today 200
     ✓ ws handshake 101
     ✓ meal month 200
     ✓ read all 200
     ✓ read one 200

     auth_token_refreshes...........: 28      0.045139/s
     chat_ws_messages_sent..........: 631     1.017234/s
     chat_ws_rtt....................: avg=3.53s   min=20ms    med=3.03s    max=13.9s    p(90)=7.19s    p(95)=8.81s    p(99)=11.94s  
     checks.........................: 100.00% ✓ 11044     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 6248      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2062      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 2734      ✗ 0    
     data_received..................: 524 MB  844 kB/s
     data_sent......................: 4.5 MB  7.2 kB/s
     http_req_blocked...............: avg=18.36µs min=927ns   med=6.24µs   max=11.25ms  p(90)=16.59µs  p(95)=21.01µs  p(99)=358.73µs
     http_req_connecting............: avg=7.12µs  min=0s      med=0s       max=11.09ms  p(90)=0s       p(95)=0s       p(99)=253.82µs
     http_req_duration..............: avg=6.23s   min=1.81ms  med=6s       max=33.7s    p(90)=11.14s   p(95)=13.3s    p(99)=18.02s  
       { expected_response:true }...: avg=6.23s   min=1.81ms  med=6s       max=33.7s    p(90)=11.14s   p(95)=13.3s    p(99)=18.02s  
     ✓ { feature:auth }.............: avg=3.24s   min=27.76ms med=2.55s    max=13.92s   p(90)=7.53s    p(95)=8.73s    p(99)=11.24s  
     ✓ { feature:board }............: avg=6.13s   min=2.36ms  med=5.99s    max=18.49s   p(90)=10.85s   p(95)=12.11s   p(99)=16.06s  
     ✓ { feature:chat }.............: avg=6.19s   min=3.83ms  med=6.28s    max=17.68s   p(90)=10.83s   p(95)=12.42s   p(99)=14.62s  
     ✓ { feature:comment }..........: avg=7.85s   min=1.81ms  med=7.01s    max=33.7s    p(90)=15.39s   p(95)=18.11s   p(99)=22.4s   
     ✓ { feature:friend }...........: avg=6.2s    min=2.97ms  med=6.38s    max=19.56s   p(90)=11.08s   p(95)=13.06s   p(99)=16.23s  
     ✓ { feature:hot }..............: avg=6.33s   min=8.14ms  med=6.42s    max=18.15s   p(90)=10.95s   p(95)=12.01s   p(99)=14.75s  
     ✓ { feature:mypage }...........: avg=6.02s   min=20.18ms med=6.07s    max=15.58s   p(90)=9.99s    p(95)=11.26s   p(99)=15.07s  
     ✓ { feature:notification }.....: avg=6.26s   min=8.81ms  med=6.09s    max=17.36s   p(90)=10.81s   p(95)=12.15s   p(99)=15.01s  
     ✓ { feature:post }.............: avg=5.74s   min=2.35ms  med=5.5s     max=18.77s   p(90)=10.39s   p(95)=11.86s   p(99)=14.7s   
     ✓ { feature:reaction }.........: avg=6.12s   min=17.36ms med=6.31s    max=15.96s   p(90)=11.05s   p(95)=12.29s   p(99)=14.36s  
     ✓ { feature:school }...........: avg=6.15s   min=39.88ms med=6.25s    max=14.13s   p(90)=11.13s   p(95)=12.08s   p(99)=14.08s  
     ✓ { feature:scrap }............: avg=5.75s   min=55.52ms med=5.99s    max=11.12s   p(90)=10.14s   p(95)=10.77s   p(99)=11s     
     ✓ { feature:timetable }........: avg=6.53s   min=4.58ms  med=6.7s     max=17.56s   p(90)=10.96s   p(95)=12.52s   p(99)=15.26s  
     ✓ { op:auth }..................: avg=3.24s   min=27.76ms med=2.55s    max=13.92s   p(90)=7.53s    p(95)=8.73s    p(99)=11.24s  
     ✗ { op:read,phase:measure }....: avg=7.26s   min=2.76ms  med=6.91s    max=27.68s   p(90)=11.79s   p(95)=13.89s   p(99)=18.26s  
     ✗ { op:write,phase:measure }...: avg=7.67s   min=29.35ms med=7.41s    max=16.76s   p(90)=12.3s    p(95)=13.97s   p(99)=16.38s  
     ✓ { page:0 }...................: avg=4.37s   min=2.35ms  med=3.74s    max=17.73s   p(90)=8.81s    p(95)=10.48s   p(99)=12.95s  
     ✓ { page:1 }...................: avg=4.36s   min=2.36ms  med=3.66s    max=13.82s   p(90)=8.1s     p(95)=9.59s    p(99)=12.64s  
     ✓ { page:2 }...................: avg=4.41s   min=3.1ms   med=3.66s    max=13.75s   p(90)=8.6s     p(95)=9.93s    p(99)=12.33s  
     ✓ { page:3 }...................: avg=4.37s   min=4.82ms  med=3.93s    max=14.78s   p(90)=7.97s    p(95)=9.91s    p(99)=14.13s  
     ✓ { page:4 }...................: avg=4.49s   min=2.51ms  med=3.74s    max=13.27s   p(90)=8.82s    p(95)=9.49s    p(99)=11.89s  
     ✓ { phase:measure }............: avg=7.28s   min=2.76ms  med=6.92s    max=27.68s   p(90)=11.87s   p(95)=13.89s   p(99)=17.92s  
     ✓ { phase:rampdown }...........: avg=5.17s   min=1.81ms  med=4.75s    max=26.17s   p(90)=10.02s   p(95)=11.64s   p(99)=16.58s  
     ✓ { phase:warmup }.............: avg=4.63s   min=4.82ms  med=3.85s    max=33.7s    p(90)=10.24s   p(95)=12.21s   p(99)=19.05s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 10934
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 6224 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 1866 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 2844 
     http_req_receiving.............: avg=2.09ms  min=16.04µs med=263.72µs max=289.35ms p(90)=1.3ms    p(95)=3.58ms   p(99)=71.67ms 
     http_req_sending...............: avg=56.78µs min=3.46µs  med=36.34µs  max=3.76ms   p(90)=115.67µs p(95)=160.95µs p(99)=251.31µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=6.23s   min=1.69ms  med=6s       max=33.68s   p(90)=11.14s   p(95)=13.3s    p(99)=18.01s  
     http_reqs......................: 10934   17.62668/s
     ✓ { feature:auth }.............: 270     0.435266/s
     ✓ { feature:board }............: 1021    1.645952/s
     ✓ { feature:chat }.............: 779     1.255824/s
     ✓ { feature:comment }..........: 1983    3.19679/s
     ✓ { feature:friend }...........: 199     0.320808/s
     ✓ { feature:hot }..............: 1021    1.645952/s
     ✓ { feature:mypage }...........: 170     0.274057/s
     ✓ { feature:notification }.....: 382     0.615821/s
     ✓ { feature:post }.............: 4676    7.53817/s
     ✓ { feature:reaction }.........: 204     0.328868/s
     ✓ { feature:school }...........: 94      0.151537/s
     ✓ { feature:scrap }............: 60      0.096726/s
     ✓ { feature:timetable }........: 75      0.120907/s
     ✓ { op:auth }..................: 270     0.435266/s
     ✓ { op:read }..................: 9887    15.938813/s
     ✓ { op:write }.................: 777     1.2526/s
     ✓ { page:0 }...................: 552     0.889878/s
     ✓ { page:1 }...................: 205     0.33048/s
     ✓ { page:2 }...................: 136     0.219245/s
     ✓ { page:3 }...................: 82      0.132192/s
     ✓ { page:4 }...................: 46      0.074157/s
     ✓ { phase:measure }............: 6224    10.033698/s
     ✓ { phase:rampdown }...........: 1866    3.008175/s
     ✓ { phase:warmup }.............: 2844    4.584807/s
     iteration_duration.............: avg=36.95s  min=1.24s   med=27.45s   max=2m12s    p(90)=1m19s    p(95)=1m29s    p(99)=1m48s   
     iterations.....................: 2460    3.965761/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 2460    3.965761/s
     ✓ { phase:measure }............: 1426    2.298852/s
     ✓ { phase:rampdown }...........: 488     0.786704/s
     ✓ { phase:warmup }.............: 546     0.880206/s
     vus............................: 1       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=4.81s   min=4.44ms  med=4.59s    max=12.81s   p(90)=8.49s    p(95)=9.44s    p(99)=12.17s  
     ws_msgs_received...............: 614     0.989828/s
     ws_msgs_sent...................: 853     1.37512/s
     ws_session_duration............: avg=27.44s  min=15.58s  med=27.47s   max=41.15s   p(90)=34.42s   p(95)=36.38s   p(99)=40.6s   
     ws_sessions....................: 111     0.178943/s